XMegaForArduino/arduino/variants/xmega128a1/pins_arduino.h
// serial port 0
#define SERIAL_0_PORT_NAME PORTD
#define SERIAL_0_USART_NAME USARTD0
#define SERIAL_0_USART_DATA USARTD0_DATA
#define SERIAL_0_RXC_ISR ISR(USARTD0_RXC_vect)
#define SERIAL_0_DRE_ISR ISR(USARTD0_DRE_vect)
//#define SERIAL_0_REMAP PORTD_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 0 */
#define SERIAL_0_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_0_REMAP is defined */
#define SERIAL_0_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_0_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */

// serial port 1
#define SERIAL_1_PORT_NAME PORTC
#define SERIAL_1_USART_NAME USARTC0
#define SERIAL_1_USART_DATA USARTC0_DATA
#define SERIAL_1_RXC_ISR ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR ISR(USARTC0_DRE_vect)
//#define SERIAL_1_REMAP PORTC_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 1 */
#define SERIAL_1_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_1_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_1_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */

// serial port 2
#define SERIAL_2_PORT_NAME PORTE
#define SERIAL_2_USART_NAME USARTE0
#define SERIAL_2_USART_DATA USARTE0_DATA
#define SERIAL_2_RXC_ISR ISR(USARTE0_RXC_vect)
#define SERIAL_2_DRE_ISR ISR(USARTE0_DRE_vect)
//#define SERIAL_2_REMAP PORTE_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 2 */
#define SERIAL_2_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_2_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_2_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */

// serial port 3
#define SERIAL_3_PORT_NAME PORTF
#define SERIAL_3_USART_NAME USARTF0
#define SERIAL_3_USART_DATA USARTF0_DATA
#define SERIAL_3_RXC_ISR ISR(USARTF0_RXC_vect)
#define SERIAL_3_DRE_ISR ISR(USARTF0_DRE_vect)
//#define SERIAL_3_REMAP PORTF_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 3 */
#define SERIAL_3_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_3_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_3_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */



// For atmega/Arduino shield compatibility, with DIGITAL_IO_PIN_SHIFT defined
// typical board/pin layout might be like this (for shield pins):
//

// NOTE:  re-do this ASCII art for the MEGA2560 layout

//               M M
//             S I O   T R
//         A   C S S S x x
//     S S R G K O I S 2 2              T R
//     D C E N 1 1 1 1                  x x
//     A L F D 3 2 1 0 9 8  7 6 5 4 3 2 1 0
// ----o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o----
//     P P     P P P P P P  P P P P P P P P
//     E E     C C C C C C  C C D D D D D D
//     1 0     7 6 5 4 3 2  1 0 7 6 5 4 3 2
//
//
//               T O P   V I E W
//
//
//                              P P P P P P
//                              A A A A A A
//                              5 4 3 2 1 0
// ------------o-o-o-o-o-o-o-o--o-o-o-o-o-o----
//             G I R 3 5 G G V  A A A A A A
//             N O E . V N N i  5 4 3 2 1 0
//             D R S 3   D D n
//               E E V
//               F T
//
// As with other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.
//
// This layout is based on the 'Rev C' Arduino.
//
// NOTE - NO AREF:  AREF is not connected.  AREF is a bit of an issue on xmega because
// it DOES! NOT! WORK! THE! SAME! as it does on the ATmegaXXX and so you would need to
// (literally) steal one of the additional analog input pins to implement it. It's not
// impossible, or even THAT difficult.  I'm just not doing it here.



#ifdef DIGITAL_IO_PIN_SHIFT // aka digital I/O pin 0 is PORTD pin 2

// SHIFTED I/O pins (atmega compatibility) - see xmega mod description in comment at top

// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

// secondary SPI on PD4-7
static const uint8_t SS1   = 2;
static const uint8_t MOSI1 = 3;
static const uint8_t MISO1 = 4;
static const uint8_t SCK1  = 5;

// default 2-wire on PE0,PE1 - TWIE  (for TWIC, you're on your own)
// NOTE:  TWIE appears it may be broken, so switch to TWIC?
static const uint8_t SDA = 14;
static const uint8_t SCL = 15;

// TODO:  alternate 2-wire ports

// keep track of the indices for port R since its control register
// settings may be slightly different
#define PR0 58
#define PR1 59

#else // no digital I/O pin shifting, PORTD pin 0 is digital I/O pin 0 (as it should be)

// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PE0,PE1 - TWIE  (for TWIC, you're on your own)
// NOTE:  TWIE appears it may be broken, so switch to TWIC?
// NOTE:  this does NOT correspond to the mega2560, which uses 20 and 21 (need more remap work)
static const uint8_t SDA = 16;
static const uint8_t SCL = 17;

// TODO:  alternate 2-wire ports TWIC?

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6
#define PR0 60
#define PR1 61

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
static const uint8_t LED_BUILTIN = PR1;


